2-project-factory
```tf

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket_object.tfvars["lab-d-121432-ro"] will be created
  + resource "google_storage_bucket_object" "tfvars" {
      + bucket         = "ten21-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "providers/2-project-factory/lab-d-121432-ro-providers.tf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.tfvars["lab-d-121432-rw"] will be created
  + resource "google_storage_bucket_object" "tfvars" {
      + bucket         = "ten21-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "providers/2-project-factory/lab-d-121432-rw-providers.tf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.projects.module.automation-bucket["lab-d-121432"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "ten21-lab-d-121432-tf-state"
      + project                     = "ten21-prod-iac-core-0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.projects.module.automation-bucket["lab-d-121432"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectCreator"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-lab-d-121432-tf-state"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-lab-d-121432-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectCreator"
    }

  # module.projects.module.automation-bucket["lab-d-121432"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-lab-d-121432-tf-state"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-lab-d-121432-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-lab-d-121432-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectViewer"
    }

  # module.projects.module.automation-service-accounts["lab-d-121432/ro"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-lab-d-121432-ro"
      + description  = "Read-only automation sa for team cloudops."
      + disabled     = false
      + display_name = "Service account ro for lab-d-121432."
      + email        = "ten21-lab-d-121432-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-lab-d-121432-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.projects.module.automation-service-accounts["lab-d-121432/rw"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-lab-d-121432-rw"
      + description  = "Read/write automation sa for team cloudops."
      + disabled     = false
      + display_name = "Service account rw for lab-d-121432."
      + email        = "ten21-lab-d-121432-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-lab-d-121432-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.projects.module.hierarchy-folder-lvl-1["cloudops"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time         = (known after apply)
      + deletion_protection = false
      + display_name        = "CloudOps"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + lifecycle_state     = (known after apply)
      + name                = (known after apply)
      + parent              = "folders/379949197155"
    }

  # module.projects.module.hierarchy-folder-lvl-1["cloudops"].google_folder_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-organization-admins@tentwentyone.io",
          + "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/owner"
    }

  # module.projects.module.hierarchy-folder-lvl-1["cloudops"].google_folder_iam_binding.authoritative["roles/resourcemanager.folderAdmin"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.folderAdmin"
    }

  # module.projects.module.hierarchy-folder-lvl-1["cloudops"].google_folder_iam_binding.authoritative["roles/resourcemanager.projectCreator"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.projectCreator"
    }

  # module.projects.module.hierarchy-folder-lvl-1["cloudops"].google_folder_iam_binding.authoritative["roles/resourcemanager.tagUser"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/resourcemanager.tagUser"
    }

  # module.projects.module.hierarchy-folder-lvl-1["cloudops"].google_folder_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_folder_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-developers@tentwentyone.io",
          + "group:gcp-devops@tentwentyone.io",
          + "group:gcp-hybrid-connectivity-admins@tentwentyone.io",
          + "group:gcp-logging-monitoring-admins@tentwentyone.io",
          + "group:gcp-logging-monitoring-viewers@tentwentyone.io",
          + "group:gcp-security-admins@tentwentyone.io",
          + "group:gcp-terraform-workshop@tentwentyone.io",
          + "group:gcp-vpc-network-admins@tentwentyone.io",
          + "group:gcp.billing.tentwentyone@tentwentyone.io",
        ]
      + role    = "roles/viewer"
    }

  # module.projects.module.hierarchy-folder-lvl-2["cloudops/dev"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time         = (known after apply)
      + deletion_protection = false
      + display_name        = "Development"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + lifecycle_state     = (known after apply)
      + name                = (known after apply)
      + parent              = (known after apply)
    }

  # module.projects.module.hierarchy-folder-lvl-2["cloudops/dev"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/281476507938981"
    }

  # module.projects.module.hierarchy-folder-lvl-2["cloudops/prod"].google_folder.folder[0] will be created
  + resource "google_folder" "folder" {
      + create_time         = (known after apply)
      + deletion_protection = false
      + display_name        = "Production"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + lifecycle_state     = (known after apply)
      + name                = (known after apply)
      + parent              = (known after apply)
    }

  # module.projects.module.hierarchy-folder-lvl-2["cloudops/prod"].google_tags_tag_binding.binding["environment"] will be created
  + resource "google_tags_tag_binding" "binding" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/281483010995173"
    }

  # module.projects.module.projects["lab-d-121432"].google_essential_contacts_contact.contact["gcp.billing.tentwentyone@tentwentyone.io"] will be created
  + resource "google_essential_contacts_contact" "contact" {
      + email                               = "gcp.billing.tentwentyone@tentwentyone.io"
      + id                                  = (known after apply)
      + language_tag                        = "en"
      + name                                = (known after apply)
      + notification_category_subscriptions = [
          + "BILLING",
        ]
      + parent                              = "projects/ten21-lab-d-121432"
    }

  # module.projects.module.projects["lab-d-121432"].google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "01C8D5-E4EA95-F2D624"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "gcp-cloudops"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "team" = "gcp-cloudops"
        }
      + name                = "ten21-lab-d-121432"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "ten21-lab-d-121432"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "gcp-cloudops"
        }
    }

  # module.projects.module.projects["lab-d-121432"].google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + role    = "roles/compute.serviceAgent"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + role    = "roles/container.serviceAgent"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["cloudbilling.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "cloudbilling.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "compute.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "container.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "iam.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "logging.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "monitoring.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "serviceusage.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service.project_services["stackdriver.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-lab-d-121432"
      + service                    = "stackdriver.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + service = "container.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + service = "monitoring.googleapis.com"
    }

  # module.projects.module.projects["lab-d-121432"].google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-lab-d-121432"
      + service = "servicenetworking.googleapis.com"
    }

  # module.projects.module.projects-iam["lab-d-121432"].google_compute_shared_vpc_service_project.shared_vpc_service[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_service" {
      + host_project    = "ten21-dev-net-spoke-0"
      + id              = (known after apply)
      + service_project = "ten21-lab-d-121432"
    }

  # module.projects.module.projects-iam["lab-d-121432"].google_project_iam_binding.authoritative["roles/logging.admin"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-logging-monitoring-admins@tentwentyone.io",
        ]
      + project = "ten21-lab-d-121432"
      + role    = "roles/logging.admin"
    }

  # module.projects.module.projects-iam["lab-d-121432"].google_project_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-organization-admins@tentwentyone.io",
          + "serviceAccount:ten21-lab-d-121432-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + project = "ten21-lab-d-121432"
      + role    = "roles/owner"
    }

  # module.projects.module.projects-iam["lab-d-121432"].google_project_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:gcp-developers@tentwentyone.io",
          + "group:gcp-devops@tentwentyone.io",
          + "group:gcp-hybrid-connectivity-admins@tentwentyone.io",
          + "group:gcp-logging-monitoring-admins@tentwentyone.io",
          + "group:gcp-logging-monitoring-viewers@tentwentyone.io",
          + "group:gcp-security-admins@tentwentyone.io",
          + "group:gcp-terraform-workshop@tentwentyone.io",
          + "group:gcp-vpc-network-admins@tentwentyone.io",
          + "group:gcp.billing.tentwentyone@tentwentyone.io",
          + "serviceAccount:ten21-lab-d-121432-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + project = "ten21-lab-d-121432"
      + role    = "roles/viewer"
    }

  # module.projects.module.projects-iam["lab-d-121432"].google_project_iam_member.shared_vpc_host_iam["group:gcp-devops@tentwentyone.io"] will be created
  + resource "google_project_iam_member" "shared_vpc_host_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-devops@tentwentyone.io"
      + project = "ten21-dev-net-spoke-0"
      + role    = "roles/compute.networkUser"
    }

Plan: 42 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + buckets          = {}
  + projects         = {
      + lab-d-121432 = {
          + automation = {
              + bucket           = "ten21-lab-d-121432-tf-state"
              + service_accounts = {
                  + ro = "ten21-lab-d-121432-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  + rw = "ten21-lab-d-121432-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                }
            }
          + id         = "ten21-lab-d-121432"
          + number     = (known after apply)
        }
    }
  + service_accounts = {}
```